000100130926     A*******************************************************
000101130926     A* Compteur                                            *
000102130926     A*                                                     *
000103130926     A*******************************************************
000104130926     A                                      UNIQUE
000105130926     A          R FCPF                      PFILE(FCP00P)
000106130926     A                                      FORMAT(FCP00P)
000107130926     A          K CPCOD
