000100130926     A*******************************************************
000101130926     A* Fichier du personnel                                *
000102130926     A*                                                     *
000103130926     A*******************************************************
000104130926     A                                      UNIQUE
000105130926     A          R FICF                      PFILE(FIC00P)
000106130926     A                                      FORMAT(FIC00P)
000107130926     A          K FIMAT
