000102130926     A          R ENTETE
000103130926     A                                      SKIPB(1)
000104130926     A                                      SPACEB(1)
000105130926     A                                     2'Programme d''édition :'
000106130926     A            ZPGM          10        23
000107130926     A                                   120'Page :'
000108130926     A            ZPAG           4  0    127
000109130926     A                                      EDTCDE(Z)
000110130926     A                                      SPACEA(1)
000111130926     A                                     2'Demandé le :'
000112130926     A            ZDATE          8  0     15
000113130926     A                                      EDTWRD('  /  /    ')
000114130926     A                                    26'par :'
000115130926     A            ZUSR          10        32
000116130926     A                                      SPACEA(1)
000117130926     A            ZTITRE        30        46
000118130926     A          R COLON
000119130926     A                                      SPACEB(1)
000120130926     A                                     1'Matricule'
000121130926     A                                    12'Nom'
000122130926     A                                    38'Prénom'
000123130926     A                                    64'Adresse'
000124130926     A                                    95'CP'
000125130926     A                                   101'Ville'
000126130926     A          R DETLIG
000127130926     A                                      SPACEB(1)
000128130926     A            ZMATR         10  0      1
000129130926     A                                      EDTCDE(Z)
000130130926     A            ZNOMC         25        12
000131130926     A            ZPRE1C        25        38
000132130926     A            ZADR1C        30        64
000133130926     A            ZCPO           5        95
000134130926     A            ZVILC         30       101
000135130926     A          R DETGEN
000136130926     A                                      SPACEB(1)
000137130926     A                                     3'Matricule'
000138130926     A            ZMATR         10  0     13
000139130926     A                                      EDTCDE(Z)
000140130926     A                                    27'Fonction'
000141130926     A            ZCODF          3        36
000142130926     A            ZLIF          35        40
000143130926     A                                      SPACEA(1)
000144130926     A                                     9'Nom'
000145130926     A            ZNOM          35        13
000146130926     A                                    49'Prénom'
000147130926     A            ZPRE1         35        56
000148130926     A            ZPRE2         35        92
000149130926     A                                      SPACEA(1)
000150130926     A                                     5'Adresse'
000151130926     A            ZAD1          35        13
000152130926     A            ZAD2          35        49
000153130926     A            ZAD3          35        85
000154130926     A                                      SPACEA(1)
000155130926     A                                    10'CP'
000156130926     A            ZCPO           5        13
000157130926     A                                    19'Ville'
000158130926     A            ZVIL          35        25
000159130926     A                                    61'Téléphone'
000160130926     A            ZTEL          20        71
000161130926     A                                    92'Portable'
000162130926     A            ZPOR          20       101
000163130926     A                                      SPACEA(1)
000164130926     A                                    10'Date d''entrée'
000165130926     A            ZDAE           8  0     26
000166130926     A                                      EDTWRD('  /  /    ')
000167130926     A                                    41'Date de départ'
000168130926     A            ZDAS           8  0     57
000169130926     A                                      EDTWRD('  /  /    ')
000170130926     A                                      SPACEA(1)
000171130926     A                                    14'Création le'
000172130926     A            ZDAC           8  0     26
000173130926     A                                      EDTWRD('  /  /    ')
000174130926     A                                    37''
000175130926     A            ZHEC           6  0     39
000176130926     A                                      EDTWRD('  :  :  ')
000177130926     A                                    48'par'
000178130926     A            ZUSC          10        52
000179130926     A                                      SPACEA(1)
000180130926     A                                    10'Modification le'
000181130926     A            ZDAM           8  0     26
000182130926     A                                      EDTWRD('  /  /    ')
000183130926     A                                    37''
000184130926     A            ZHEM           6  0     39
000185130926     A                                      EDTWRD('  :  :  ')
000186130926     A                                    48'par'
000187130926     A            ZUSM          10        52
000188130926     A                                      SPACEA(1)
000189130926     A          R FIN
000190130926     A                                      SPACEB(1)
000191130926     A                                     2'Nombre total de lignes :'
000192130926     A            ZLIG          10  0     27
000193130926     A                                      EDTCDE(Z)
000194130926     A                                      SPACEA(1)
