000100131127     A                                      DSPSIZ(24 80 *DS3)
000101131127     A                                      MSGLOC(24)
000102131127     A                                      PRINT
000103131127     A                                      HELP
000104131127     A                                      HLPPNLGRP('XX' XX)
000105131127     A                                      HLPTITLE('Liste fonction')
000106131127     A                                      ALTHELP(CA01)
000107131127     A          R SFL01                     SFL
000108131127     A  08                                  SFLNXTCHG
000109131127     A            ZOPT           1   B  7  3
000110131127     A  12                                  DSPATR(RI PC)
000111131127     A                                      COLOR(WHT)
000112131127     A            ZCOD           3   O  7  6
000113131127     A            ZLIB          30   O  7 11
000114131127     A            ZDAC           8  0O  7 42
000115131127     A                                      EDTWRD('  /  /    ')
000116131127     A            ZDAM           8  0O  7 53
000117131127     A                                      EDTWRD('  /  /    ')
000118131127     A            ZNBEM          6  0O  7 67
000119131127     A                                      EDTCDE(Z)
000120131127     A            HNREC         10  0H
000121131127     A          R FORE1                     SFLCTL(SFL01)
000122131127     A                                      RTNCSRLOC(&WLICSR &WZOCSR &WPRCSR)
000123131127     A                                      OVERLAY
000124131127     A                                      PUTOVR
000125131127     A N07                                  ROLLUP(02)
000126131127     A                                      CSRLOC(WLIGN  WCOLN)
000127131127     A                                      CHANGE(91)
000128131127     A N04                                  ERASE(SFL01)
000129131127     A  04                                  SFLDSP
000130131127     A  05                                  SFLDSPCTL
000131131127     A  06                                  SFLCLR
000132131127     A  07                                  SFLEND
000133131127     A                                      SFLSIZ(16)
000134131127     A                                      SFLPAG(15)
000135131127     A                                      SFLCSRRRN(&WRACSR)
000136131127     A            WRACSR         5S 0H
000137131127     A            WRAN01         4S 0H      SFLRCDNBR
000138131127     A            ZPGM          10   O  1  2
000139131127     A                                      OVRDTA
000140131127     A                                  1 31'Liste des fonctions'
000141131127     A                                      COLOR(WHT)
000142131127     A            ZUSER         10   O  1 70
000143131127     A                                      OVRDTA
000144131127     A            ZDATE          8  0O  2  2
000145131127     A                                      EDTWRD('  /  /    ')
000146131127     A                                      OVRDTA
000147131127     A            ZHEUR          6  0O  2 14
000148131127     A                                      EDTWRD('  :  :  ')
000149131127     A                                      OVRDTA
000150131127     A            ZJOB          10   O  2 70
000151131127     A                                      OVRDTA
000152131127     A                                  4  3'Indiquez vos options, puis
000153131127     A                                       sur ENTREE.'
000154131127     A                                      COLOR(BLU)
000155131127     A                                  5  3'2=Modifier      3=Copier  -
000156131127     A                                      4=Supprimer    5=Afficher'
000157131127     A                                      COLOR(BLU)
000158131128     A                                  6  2'Opt Code Libellé                  -
000159131128     A                                            Création   Modification  Nb e-
000160131127     A                                      mployés'
000161131127     A                                      COLOR(WHT)
000162131127     A            WLICSR        10A  H
000163131127     A            WZOCSR        10A  H
000164131127     A            WPRCSR         4S 0H
000165131127     A            WLIGN          3S 0H
000166131127     A            WCOLN          3S 0H
000167131127     A          R FORB1
000168131127     A                                      CF03
000169131127     A                                      CF05
000170131127     A                                      CF06
000171131127     A                                      CF12
000172131127                                            RTNCSRLOC(&WLICSR &WZOCSR &WPRCSR)
000173131127     A                                      OVERLAY
000174131127     A                                      PUTOVR
000175131127     A                                      CSRLOC(WLIGN  WCOLN)
000176131127     A                                      CHANGE(91)
000177131127     A                                 23  3'F3=Exit  F5=Réafficher  F6=Cr-
000178131127     A                                      éer      F12=Annuler'
000179131127     A                                      COLOR(BLU)
000180131127     A            WLICSR        10A  H
000181131127     A            WZOCSR        10A  H
000182131127     A            WPRCSR         4S 0H
000183131127     A            WLIGN          3S 0H
000184131127     A            WCOLN          3S 0H
000185131127     A          R WSFMSG                    SFL
000186131127     A                                      SFLMSGRCD(24)
000187131127     A            WMGKEY                    SFLMSGKEY
000188131127     A            WPGMQ                     SFLPGMQ
000189131127     A          R WSFCTL                    SFLCTL(WSFMSG)
000190131127     A                                      SFLSIZ(2)
000191131127     A                                      SFLPAG(1)
000192131127     A                                      OVERLAY
000193131127     A  10                                  SFLINZ
000194131127     A                                      SFLDSP
000195131127     A                                      SFLDSPCTL
000196131127     A  09                                  SFLEND
000197131127     A            WPGMQ                     SFLPGMQ
