000100131127     A                                      DSPSIZ(24 80 *DS3)
000101131127     A                                      MSGLOC(24)
000102131127     A                                      PRINT
000103131127     A                                      HELP
000104131127     A                                      HLPPNLGRP('PGMF30' PGMF30)
000105131127     A                                      HLPTITLE('Liste outq')
000106131127     A                                      ALTHELP(CA01)
000107131127     A          R SFL01                     SFL
000108131127     A  08                                  SFLNXTCHG
000109131127     A            ZMUSR         10   B  8  6
000110131127     A                                      COLOR(GRN)
000111131127     A            ZMDOC         10   B  8 17
000112131127     A                                      COLOR(GRN)
000113131127     A            ZMPRT         10   B  8 28
000114131127     A                                      COLOR(GRN)
000115131127     A            HNREC         10  0H
000116131127     A          R FORE1                     SFLCTL(SFL01)
000117131127     A                                      RTNCSRLOC(&WLICSR &WZOCSR &WPRCSR)
000118131127     A                                      OVERLAY
000119131127     A                                      PUTOVR
000120131127     A N07                                  ROLLUP(02)
000121131127     A                                      CSRLOC(WLIGN WCOLN)
000122131127     A                                      CHANGE(91)
000123131127     A N04                                  ERASE(SFL01)
000124131127     A  04                                  SFLDSP
000125131127     A  05                                  SFLDSPCTL
000126131127     A  06                                  SFLCLR
000127131127     A  07                                  SFLEND
000128131127     A                                      SFLSIZ(15)
000129131127     A                                      SFLPAG(14)
000130131127     A                                      SFLCSRRRN(&WRACSR)
000131131127     A            WRACSR         5S 0H
000132131127     A            WRAN01         4S 0H      SFLRCDNBR
000133131127     A            ZPGM          10   O  1  2
000134131127     A                                      OVRDTA
000135131127     A                                  1 31'Liste des Imprimantes'
000136131127     A                                      COLOR(WHT)
000137131127     A            ZUSER         10   O  1 70
000138131127     A                                      OVRDTA
000139131127     A            ZDATE          8  0O  2  2
000140131127     A                                      EDTWRD('  /  /    ')
000141131127     A                                      OVRDTA
000142131127     A            ZHEUR          6  0O  2 14
000143131127     A                                      EDTWRD('  :  :  ')
000144131127     A                                      OVRDTA
000145131127     A            ZJOB          10   O  2 70
000146131127     A                                      OVRDTA
000147131127     A                                  5  2'Selection User/Doc/Print :'
000148131127     A            ZSUSR         10   B  5 29
000149131127     A                                      COLOR(WHT)
000150131127     A                                      OVRDTA
000151131127     A            ZSDOC         10   B  5 40
000152131127     A                                      COLOR(WHT)
000153131127     A                                      OVRDTA
000154131127     A            ZSPRT         10   B  5 51
000155131127     A                                      COLOR(WHT)
000156131127     A                                      OVRDTA
000157131127     A                                  7  2'    User       Document
000158131127     A                                      te
000159131127     A                                                '
000160131127     A                                      COLOR(WHT)
000161131127     A            WLICSR        10A  H
000162131127     A            WZOCSR        10A  H
000163131127     A            WPRCSR         4S 0H
000164131127     A            WLIGN          3S 0H
000165131127     A            WCOLN          3S 0H
000166131127     A          R FORB1
000167131127     A                                      CF03
000168131127     A                                      CF06
000169131127     A                                      CF15
000170131127     A                                      RTNCSRLOC(&WLICSR &WZOCSR &WPRCSR)
000171131127     A                                      OVERLAY
000172131127     A                                      PUTOVR
000173131127     A                                      CSRLOC(WLIGN WCOLN)
000174131127     A                                      CHANGE(91)
000175131127     A                                 23  3'F3=Exit     F6=Créer     F
000176131127     A                                      yage'
000177131127     A                                      COLOR(BLU)
000178131127     A            WLICSR        10A  H
000179131127     A            WZOCSR        10A  H
000180131127     A            WPRCSR         4S 0H
000181131127     A            WLIGN          3S 0H
000182131127     A            WCOLN          3S 0H
000183131127     A          R WSFMSG                    SFL
000184131127     A                                      SFLMSGRCD(24)
000185131127     A            WMGKEY                    SFLMSGKEY
000186131127     A            WPGMQ                     SFLPGMQ
000187131127     A          R WSFCTL                    SFLCTL(WSFMSG)
000188131127     A                                      SFLSIZ(2)
000189131127     A                                      SFLPAG(1)
000190131127     A                                      OVERLAY
000191131127     A  10                                  SFLINZ
000192131127     A                                      SFLDSP
000193131127     A                                      SFLDSPCTL
000194131127     A  09                                  SFLEND
000195131127     A            WPGMQ                     SFLPGMQ
