000100131127     A                                      DSPSIZ(24 80 *DS3)
000101131127     A                                      MSGLOC(24)
000102131127     A                                      PRINT
000103131127     A                                      HELP
000104131127     A                                      HLPPNLGRP('PGMF02' PGMF02)
000105131128     A                                      HLPTITLE('Détail personnel')
000106131127     A                                      ALTHELP(CA01)
000107131127     A          R FORE1
000108131127     A                                      CF03
000109131127     A                                      CF04
000110131127     A                                      CF12
000111131127     A                                      CF15
000112131127     A                                      RTNCSRLOC(&WFMCUR &WZOCUR &WPRCUR)
000113131127     A                                      PUTOVR
000114131127     A                                      CSRLOC(WNMLGN WNMCOL)
000115131127     A                                      CHANGE(91)
000116131127     A                                      HLPCLR
000117131127     A          H                           HLPARA(5 19 5 29)
000118131127     A                                      HLPPNLGRP('ZMATR' PGMF02)
000119131127     A          H                           HLPARA(5 44 5 47)
000120131127     A                                      HLPPNLGRP('ZFCOD' PGMF02)
000121131127     A          H                           HLPARA(6 19 6 54)
000122131127     A                                      HLPPNLGRP('ZNOM' PGMF02)
000123131127     A          H                           HLPARA(7 19 7 54)
000124131127     A                                      HLPPNLGRP('ZPR1' PGMF02)
000125131127     A          H                           HLPARA(8 19 8 54)
000126131127     A                                      HLPPNLGRP('ZPR2' PGMF02)
000127131127     A          H                           HLPARA(9 19 9 54)
000128131127     A                                      HLPPNLGRP('ZAD1' PGMF02)
000129131127     A          H                           HLPARA(10 19 10 54)
000130131127     A                                      HLPPNLGRP('ZAD2' PGMF02)
000131131127     A          H                           HLPARA(11 19 11 54)
000132131127     A                                      HLPPNLGRP('ZAD3' PGMF02)
000133131127     A          H                           HLPARA(12 19 12 29)
000134131127     A                                      HLPPNLGRP('ZCPO' PGMF02)
000135131127     A          H                           HLPARA(13 19 13 54)
000136131127     A                                      HLPPNLGRP('ZVIL' PGMF02)
000137131127     A          H                           HLPARA(14 19 14 39)
000138131127     A                                      HLPPNLGRP('ZTEL' PGMF02)
000139131127     A          H                           HLPARA(14 52 14 72)
000140131127     A                                      HLPPNLGRP('ZPOR' PGMF02)
000141131127     A          H                           HLPARA(16 19 16 29)
000142131127     A                                      HLPPNLGRP('ZDAE' PGMF02)
000143131127     A          H                           HLPARA(16 48 16 58)
000144131127     A                                      HLPPNLGRP('ZDAS' PGMF02)
000145131127     A            ZPGM          10   O  1  2
000146131127     A                                      OVRDTA
000147131127     A                                  1 31'Détail fiche personnel'
000148131127     A                                      COLOR(WHT)
000149131127     A            ZUSER         10   O  1 70
000150131127     A                                      OVRDTA
000151131127     A            ZDATE          8  0O  2  2
000152131127     A                                      EDTWRD('  /  /    ')
000153131127     A                                      OVRDTA
000154131127     A            ZHEUR          6  0O  2 14
000155131127     A                                      EDTWRD('  :  :  ')
000156131127     A                                      OVRDTA
000157131127     A            ZMODE         30   O  2 27
000158131127     A                                      COLOR(WHT)
000159131127     A                                      OVRDTA
000160131127     A            ZJOB          10   O  2 70
000161131127     A                                      OVRDTA
000162131127     A                                  5  7'Matricule :'
000163131127     A            ZMATR         10Y 0   5 19
000164131127     A                                      EDTCDE(Z)
000165131127     A                                      COLOR(WHT)
000166131127     A                                      OVRDTA
000167131127     A                                  5 33'Fonction :'
000168131127     A            ZFCOD          3   B  5 44
000169131127     A N14                                  DSPATR(UL)
000170131127     A  14                                  DSPATR(PR)
000171131127     A                                      COLOR(WHT)
000172131127     A                                      OVRDTA
000173131127     A                                      OVRATR
000174131127     A            ZFLIB         20   O  5 49
000175131127     A                                      OVRDTA
000176131127     A                                  6 13'Nom :'
000177131127     A            ZNOM          35   B  6 19
000178131127     A N15                                  DSPATR(UL)
000179131127     A  15                                  DSPATR(PR)
000180131127     A                                      CHECK(LC)
000181131127     A                                      COLOR(WHT)
000182131127     A                                      OVRDTA
000183131127     A                                      OVRATR
000184131127     A                                  7 10'Prénom :'
000185131127     A            ZPR1          35   B  7 19
000186131127     A N16                                  DSPATR(UL)
000187131127     A  16                                  DSPATR(PR)
000188131127     A                                      CHECK(LC)
000189131127     A                                      COLOR(WHT)
000190131127     A                                      OVRDTA
000191131127     A                                      OVRATR
000192131127     A            ZPR2          35   B  8 19
000193131127     A N16                                  DSPATR(UL)
000194131127     A  16                                  DSPATR(PR)
000195131127     A                                      CHECK(LC)
000196131127     A                                      COLOR(WHT)
000197131127     A                                      OVRDTA
000198131127     A                                      OVRATR
000199131127     A                                  9  9'Adresse :'
000200131127     A            ZAD1          35   B  9 19
000201131127     A N16                                  DSPATR(UL)
000202131127     A  16                                  DSPATR(PR)
000203131127     A                                      CHECK(LC)
000204131127     A                                      COLOR(WHT)
000205131127     A                                      OVRDTA
000206131127     A                                      OVRATR
000207131127     A            ZAD2          35   B 10 19
000208131127     A N16                                  DSPATR(UL)
000209131127     A  16                                  DSPATR(PR)
000210131127     A                                      CHECK(LC)
000211131127     A                                      COLOR(WHT)
000212131127     A                                      OVRDTA
000213131127     A                                      OVRATR
000214131127     A            ZAD3          35   B 11 19
000215131127     A N16                                  DSPATR(UL)
000216131127     A  16                                  DSPATR(PR)
000217131127     A                                      CHECK(LC)
000218131127     A                                      COLOR(WHT)
000219131127     A                                      OVRDTA
000220131127     A                                      OVRATR
000221131127     A                                 12  5'Code postal :'
000222131127     A            ZCPO          10   B 12 19
000223131127     A N16                                  DSPATR(UL)
000224131127     A  16                                  DSPATR(PR)
000225131127     A                                      COLOR(WHT)
000226131127     A                                      OVRDTA
000227131127     A                                      OVRATR
000228131127     A                                 13 11'Ville :'
000229131127     A            ZVIL          35   B 13 19
000230131127     A N16                                  DSPATR(UL)
000231131127     A  16                                  DSPATR(PR)
000232131127     A                                      CHECK(LC)
000233131127     A                                      COLOR(WHT)
000234131127     A                                      OVRDTA
000235131127     A                                      OVRATR
000236131127     A                                 14  7'Téléphone :'
000237131127     A            ZTEL          20   B 14 19
000238131127     A N16                                  DSPATR(UL)
000239131127     A  16                                  DSPATR(PR)
000240131127     A                                      COLOR(WHT)
000241131127     A                                      OVRDTA
000242131127     A                                      OVRATR
000243131127     A                                 14 41'Portable :'
000244131127     A            ZPOR          20   B 14 52
000245131127     A N16                                  DSPATR(UL)
000246131127     A  16                                  DSPATR(PR)
000247131127     A                                      COLOR(WHT)
000248131127     A                                      OVRDTA
000249131127     A                                      OVRATR
000250131127     A                                 16  3'Date d''entrée :'
000251131127     A            ZDAE           8Y 0B 16 19
000252131127     A N17                                  DSPATR(UL)
000253131127     A  17                                  DSPATR(PR)
000254131127     A                                      EDTWRD('  /  /    ')
000255131127     A                                      COLOR(WHT)
000256131127     A                                      OVRDTA
000257131127     A                                      OVRATR
000258131127     A                                 16 31'Date de départ :'
000259131127     A            ZDAS           8Y 0B 16 48
000260131127     A N18                                  DSPATR(UL)
000261131127     A  18                                  DSPATR(PR)
000262131127     A                                      EDTWRD('  /  /    ')
000263131127     A                                      COLOR(WHT)
000264131127     A                                      OVRDTA
000265131127     A                                      OVRATR
000266131127     A                                 18 13'Crée le :'
000267131127     A            ZDAC           8  0O 18 25
000268131127     A                                      EDTWRD('  /  /    ')
000269131127     A                                      COLOR(GRN)
000270131127     A                                      OVRDTA
000271131127     A                                 18 37' :'
000272131127     A            ZHEC           6  0O 18 41
000273131127     A                                      EDTWRD('  :  :  ')
000274131127     A                                      OVRDTA
000275131127     A                                 18 51'par :'
000276131127     A            ZUSC          10   O 18 57
000277131127     A                                      OVRDTA
000278131127     A                                 19 10'Modifié le :'
000279131127     A            ZDAM           8  0O 19 25
000280131127     A                                      EDTWRD('  /  /    ')
000281131127     A                                      COLOR(GRN)
000282131127     A                                      OVRDTA
000283131127     A                                 19 37' :'
000284131127     A            ZHEM           6  0O 19 41
000285131127     A                                      EDTWRD('  :  :  ')
000286131127     A                                      OVRDTA
000287131127     A                                 19 51'par :'
000288131127     A            ZUSM          10   O 19 57
000289131127     A                                      OVRDTA
000290131127     A                                 23  3'F3=Exit   F4=Invite  F12=Annuler'
000291131127     A                                      COLOR(BLU)
000292131127     A            WFMCUR        10A  H
000293131127     A            WZOCUR        10A  H
000294131127     A            WPRCUR         4S 0H
000295131127     A            WNMLGN         3S 0H
000296131127     A            WNMCOL         3S 0H
000297131127     A          R WMGSFL                    SFL
000298131127     A                                      SFLMSGRCD(24)
000299131127     A            WMGKEY                    SFLMSGKEY
000300131127     A            WPGMQ                     SFLPGMQ
000301131127     A          R WMGCTL                    SFLCTL(WMGSFL)
000302131127     A                                      SFLSIZ(2)
000303131127     A                                      SFLPAG(1)
000304131127     A                                      OVERLAY
000305131127     A  10                                  SFLINZ
000306131127     A                                      SFLDSP
000307131127     A                                      SFLDSPCTL
000308131127     A  09                                  SFLEND
000309131127     A            WPGMQ                     SFLPGMQ
